<a href="https://colab.research.google.com/github/carloslizarragac/FisicaComputacional1/blob/master/Actividad3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


**Introducción a Pandas**

**Pandas** es la biblioteca de Python que se utiliza para la manipulación y análisis de datos

In [ ]:
# Importamos las bibliotecas a utilizar
import pandas as pd
import numpy as np

Pandas maneja dos tipos de estructuras de datos: Series y DataFrames (Marcos de datos - similar a una hoja de cálculo)

In [79]:
# Creamos el DataFrame compra a partir de un diccionario de datos
# Hay muchas formas de declarar este tipo de objetos. 
# Se introdujo un espacio vacío '', haciendo alusión a que no se tiene ese dato. 
data ={'manzanas':[3,2,0,1],'naranjas':[0,'',7,2]}
df_compras = pd.DataFrame(data)
df_compras

   manzanas naranjas
0         3        0
1         2
2         0        7
3         1        2

En la imágen del DataFrame **df_compras** anterior, existen las *variables* (nombres de las columnas) y las *instancias de realización* de esa variable, enumerado por un índice (Python comienza a contar desde 0).

In [80]:
# Añadimos la lista de personas que compran fruta 
clientes = ['Ana', 'Roberto', 'Lily', 'David']
df_compras = pd.DataFrame(data, index=clientes)
df_compras

         manzanas naranjas
Ana             3        0
Roberto         2
Lily            0        7
David           1        2

In [81]:
# Podemos ver que compró Ana (selección del renglón con .loc)
df_compras.loc['Ana']

manzanas    3
naranjas    0
Name: Ana, dtype: object

In [82]:
df_compras.iloc[0]

manzanas    3
naranjas    0
Name: Ana, dtype: object

In [ ]:
# Se puede escribir a un archivo csv el DataFrame df_compras
df_compras.to_csv('compras.csv')

Pandas permite leer y escribir archivos csv, Excel y otros formatos (JSON, SQL, y más)

In [ ]:
# Imrimimos los primeros 3 renglones del DatFrame
df_compras=pd.read_csv('compras.csv')
df_compras.head(3)

  Unnamed: 0  manzanas  naranjas
0        Ana         3       0.0
1    Roberto         2       NaN
2       Lily         0       7.0

In [ ]:
# Podemos renombrar las columnas 
df_compras.rename(columns={'Unnamed: 0': 'Nombre'}, inplace=True)

In [ ]:
df_compras.head()

    Nombre  manzanas  naranjas
0      Ana         3       0.0
1  Roberto         2       NaN
2     Lily         0       7.0
3    David         1       2.0

In [ ]:
# Dimensiones del DataFrame (renglones, columnas)
df_compras.shape

(4, 3)

In [ ]:
# Imprime la informaciónd el DataFrame
df_compras.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   manzanas  4 non-null      int64
 2   naranjas  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [ ]:
# Realiza una estadística breve de las variables numéricas
df_compras.describe()

       manzanas  naranjas
count  4.000000  3.000000
mean   1.500000  3.000000
std    1.290994  3.605551
min    0.000000  0.000000
25%    0.750000  1.000000
50%    1.500000  2.000000
75%    2.250000  4.500000
max    3.000000  7.000000

In [ ]:
# En el caso de variables no numéricas, hace un conteo.
df_compras['Nombre'].describe()

count           4
unique          4
top       Roberto
freq            1
Name: Nombre, dtype: object

In [ ]:
df_compras.value_counts().head()

Nombre  manzanas  naranjas
Lily    0         7.0         1
David   1         2.0         1
Ana     3         0.0         1
dtype: int64

In [ ]:
df_compras.columns

Index(['manzanas', 'naranjas'], dtype='object')

In [ ]:
df_compras.columns = ['Names', 'apples', 'oranges']

In [ ]:
df_compras.columns

Index(['Names', 'apples', 'oranges'], dtype='object')

In [ ]:
df_compras.head()

    Nombre  manzanas  naranjas
0      Ana         3       0.0
1  Roberto         2       NaN
2     Lily         0       7.0
3    David         1       2.0

In [ ]:
df_compras.head()

     Names  apples  oranges
0      Ana       3      0.0
1  Roberto       2      NaN
2     Lily       0      7.0
3    David       1      2.0

In [65]:
# Creación de un ejemplo de DataFrame con valores aleatorios
from numpy.random import randn
df = pd.DataFrame(randn(6,4),index='0 1 2 3 4 5'.split(),columns='A B C D'.split())

In [ ]:
df

          A         B         C         D
0 -1.564055  0.305034 -0.958470 -0.090069
1 -0.546921  2.114905 -0.870584 -0.683636
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086
5  0.164606  0.516558  1.524541  2.309395

In [ ]:
# Imprime el tercer renglon con etiqueta '3' 
df.loc['3']

A   -0.833513
B    0.248365
C    0.749542
D    1.139157
Name: 3, dtype: float64

In [ ]:
# Imprime el renglón con índice 3
df.iloc[3]

A   -0.833513
B    0.248365
C    0.749542
D    1.139157
Name: 3, dtype: float64

In [ ]:
# Imprime un elemento específico. 
df.loc['2', 'C']

-0.5114823621478797

In [ ]:
# Imprime un rango de renglones
df.loc['2':'4']

          A         B         C         D
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086

In [ ]:
# Imprime un rango de renglones (No imprime el renglón del límite superior)
df.iloc[2:4]

          A         B         C         D
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157

In [ ]:
# Imprimiendo sólo columnas
df.loc['0':'4','A':'B']

          A         B
0 -1.564055  0.305034
1 -0.546921  2.114905
2 -1.047579 -0.255980
3 -0.833513  0.248365
4  0.294051  0.137719

In [69]:
# Imprimimos de forma directa dos columnas
df[['A','B']]

          A         B
0 -0.530188  0.327552
1 -0.770971  1.566003
2  2.260010 -0.491224
3  0.443402  0.347935
4 -1.052314 -0.475513
5 -0.028077 -1.773423

In [70]:
# India donde se cumple la condición
df>0.5

       A      B      C      D
0  False  False   True   True
1  False   True  False  False
2   True  False   True   True
3  False  False   True   True
4  False  False  False  False
5  False  False  False   True

In [71]:
df

          A         B         C         D
0 -0.530188  0.327552  0.895204  1.649647
1 -0.770971  1.566003  0.135765 -0.179536
2  2.260010 -0.491224  1.128033  3.211241
3  0.443402  0.347935  2.035852  0.890888
4 -1.052314 -0.475513  0.484469 -0.240338
5 -0.028077 -1.773423 -2.319345  0.634954

In [ ]:
# Filtra los renglones donde la columna B cumple la condición
df[df['B'] <= 0.25]

          A         B         C         D
2 -1.047579 -0.255980 -0.511482  0.152245
3 -0.833513  0.248365  0.749542  1.139157
4  0.294051  0.137719  0.086907 -1.654086

In [ ]:
 # Se pueden combinar condiciones para filtrar renglones
 df[(df['B'] <= 0.25) & (df['C'] >= 0.5)]

          A         B         C         D
3 -0.833513  0.248365  0.749542  1.139157

In [74]:
# Ejemplo de DataFrame con valores vacíos
import numpy as np
df2 = pd.DataFrame({'A':[1,np.nan,3,4,np.nan,7,2,np.nan],
                  'B':[5,np.nan,6,5,7,2,np.nan,5],
                  'C':[5,3,6,5,7,2,8,5],
                  'D':[1,2,3,np.nan,5,np.nan,7,8]})

In [73]:
df2

     A    B  C    D
0  1.0  5.0  5  1.0
1  NaN  NaN  3  2.0
2  3.0  6.0  6  3.0
3  4.0  5.0  5  NaN
4  NaN  7.0  7  5.0
5  7.0  2.0  2  NaN
6  2.0  NaN  8  7.0
7  NaN  5.0  5  8.0

In [ ]:
# Selecciona solo renglones que no tienen algún dato vacío
df2.dropna()

     A    B  C    D
0  1.0  5.0  5  1.0
2  3.0  6.0  6  3.0

In [ ]:
# Selecciona solo columnas que no tienen ningún dato vacío
df2.dropna(axis=1)

   C
0  5
1  3
2  6
3  5
4  7
5  2
6  8
7  5

In [75]:
# Se define un DataFrame con valores vacíos rellenados con el valor 0.
df3=df2.fillna(value=0)
df3

     A    B  C    D
0  1.0  5.0  5  1.0
1  0.0  0.0  3  2.0
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0
4  0.0  7.0  7  5.0
5  7.0  2.0  2  0.0
6  2.0  0.0  8  7.0
7  0.0  5.0  5  8.0

In [ ]:
df3.iloc[2:4]

     A    B  C    D
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0

In [ ]:
df3.loc['2':'4']

     A    B  C    D
2  3.0  6.0  6  3.0
3  4.0  5.0  5  0.0
4  0.0  7.0  7  5.0

In [ ]:
df3[df3['B'] == 5.0]

     A    B  C    D
0  1.0  5.0  5  1.0
3  4.0  5.0  5  0.0
7  0.0  5.0  5  8.0

In [ ]:
df3[(df3['B'] == 5.0) & (df3['D'] < 2.0)]

     A    B  C    D
0  1.0  5.0  5  1.0
3  4.0  5.0  5  0.0

In [ ]:
df4=df3[['B','C']]
df4

     B  C
0  5.0  5
1  0.0  3
2  6.0  6
3  5.0  5
4  7.0  7
5  2.0  2
6  0.0  8
7  5.0  5


**Leyendo un archivo de datos a Pandas**

En esta sección iniciamos con los preparativos para leer el archivo de datos meteorológicos que deseamos analizar.

In [5]:
import pandas as pd
import numpy as np

# Tomar la dirección URL del archivo en formato 'raw'
url = 'https://raw.githubusercontent.com/carloslizarragac/FisicaComputacional1/master/Actividad1/Guaymas26292.txt'

# Definimos los nombres de las columnas
# El archivo tiene códigos ASCII extendido (Español), encoding='cp1251' Windows (Europa Occidental)
# El separador de datos es de uno o más espacios, sep='\s+'
# Se brincará los primeros 19 renglones y el último, afirmamos que no nay encabezado
# Se procesan los datos utilizando Python, engine='python' 
my_cols = ['Fecha', 'Precip', 'Evap', 'Tmax', 'Tmin']
df_dist = pd.read_csv(url, names=my_cols, encoding='cp1251', sep='\s+', header=None, skiprows=19, skipfooter=1, engine='python')

In [6]:
# Revisamos el encabezado y el final del dataframe
print(df_dist.head(3))
print(df_dist.tail())

        Fecha Precip  Evap Tmax Tmin
0  01/02/1967      0  Nulo   20    8
1  02/02/1967      0  Nulo   21    9
2  03/02/1967      0  Nulo   26    8
            Fecha Precip  Evap Tmax Tmin
17874  26/09/2016      0  Nulo   37   20
17875  27/09/2016      0  Nulo   37   20
17876  28/09/2016      0  Nulo   38   20
17877  29/09/2016      0  Nulo   37   24
17878  30/09/2016      0  Nulo   37   21

In [7]:
# Investigamos su tamaño con la función shape (renglones, columnas)
df_dist.shape

(17879, 5)

In [8]:
# Información del dataframe
df_dist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17879 entries, 0 to 17878
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   17879 non-null  object
 1   Precip  17879 non-null  object
 2   Evap    17879 non-null  object
 3   Tmax    17879 non-null  object
 4   Tmin    17879 non-null  object
dtypes: object(5)
memory usage: 698.5+ KB

In [31]:
# Hacemos una copia de trabajo y preservamos el dataframe original
df_work0 = df_dist.copy()
df_work0.head()

        Fecha Precip  Evap Tmax Tmin
0  01/02/1967      0  Nulo   20    8
1  02/02/1967      0  Nulo   21    9
2  03/02/1967      0  Nulo   26    8
3  04/02/1967      0  Nulo   25    7
4  05/02/1967      0  Nulo   23    7

In [32]:
# Reemplazamos los textos 'Nulo' por espacio en blanco ''
str_Nulo = 'Nulo'
df_work1 = df_work0.replace(to_replace=str_Nulo, value='', regex=True)
df_work1.head()

        Fecha Precip Evap Tmax Tmin
0  01/02/1967      0        20    8
1  02/02/1967      0        21    9
2  03/02/1967      0        26    8
3  04/02/1967      0        25    7
4  05/02/1967      0        23    7

In [33]:
# Imprimimos la información actualizada del dataframe
df_work1.info()
print(df_work1.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17879 entries, 0 to 17878
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   17879 non-null  object
 1   Precip  17879 non-null  object
 2   Evap    17879 non-null  object
 3   Tmax    17879 non-null  object
 4   Tmin    17879 non-null  object
dtypes: object(5)
memory usage: 698.5+ KB
        Fecha Precip Evap Tmax Tmin
0  01/02/1967      0        20    8
1  02/02/1967      0        21    9
2  03/02/1967      0        26    8
3  04/02/1967      0        25    7
4  05/02/1967      0        23    7

**Convirtiendo objetos a números flotantes.** 

Primero atenderemos las columnas de datos que son reales o flotantes (Precipitación, Evaporación, Temperatura Máxima y la Mínima).

In [34]:
# Deseamos convertir los valores de las variables ambientales a núm. flotantes 
cols_list = ['Precip', 'Evap', 'Tmax', 'Tmin']
for cols in cols_list:
  df_work1[cols] = pd.to_numeric(df_work1[cols], errors='coerce')

df_work1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17879 entries, 0 to 17878
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   17879 non-null  object
 1   Precip  17847 non-null  float64
 2   Evap    5731 non-null   float64
 3   Tmax    17823 non-null  float64
 4   Tmin    17828 non-null  float64
dtypes: float64(4), object(1)
memory usage: 698.5+ KB

In [35]:
# De la instrucción anterior, vemos que hay valores faltantes. Sumamos los valores nulos. 
df_work1.isnull().sum()

Fecha         0
Precip       32
Evap      12148
Tmax         56
Tmin         51
dtype: int64

In [36]:
print(df_work1.head())
print(df_work1.head())

        Fecha  Precip  Evap  Tmax  Tmin
0  01/02/1967     0.0   NaN  20.0   8.0
1  02/02/1967     0.0   NaN  21.0   9.0
2  03/02/1967     0.0   NaN  26.0   8.0
3  04/02/1967     0.0   NaN  25.0   7.0
4  05/02/1967     0.0   NaN  23.0   7.0
        Fecha  Precip  Evap  Tmax  Tmin
0  01/02/1967     0.0   NaN  20.0   8.0
1  02/02/1967     0.0   NaN  21.0   9.0
2  03/02/1967     0.0   NaN  26.0   8.0
3  04/02/1967     0.0   NaN  25.0   7.0
4  05/02/1967     0.0   NaN  23.0   7.0

In [37]:
# Un análisis estadístico breve de las variables numéricas redondeado a 2 cifras significativas
df_work1.describe().round(2)

         Precip     Evap      Tmax      Tmin
count  17847.00  5731.00  17823.00  17828.00
mean       0.75     5.98     32.62     15.33
std        5.07     2.60      5.63      6.71
min        0.00     0.10     10.00     -2.00
25%        0.00     4.00     28.00     10.00
50%        0.00     5.80     33.00     14.00
75%        0.00     7.80     37.00     22.00
max      184.10    16.40     48.50     32.00

**Ahora trabajaremos la variable Fecha.**

Una variable tipo fecha, contiene mucha información condensada (Año, Mes, Día, Hora, Minuto, Segundo y fracciones de Segundo). Buscamos acceder a toda esa información para utilizarla. 

Python tiene algunas herramientas para trabajar las fechas. Veamos algunas de ellas.

In [38]:
# Volvemos a hacer una pausa y definimos un nuevo dataframe por si hay que regresarse.
df_work2 = df_work1.copy()
df_work2['Fecha'].head()

0    01/02/1967
1    02/02/1967
2    03/02/1967
3    04/02/1967
4    05/02/1967
Name: Fecha, dtype: object

In [39]:
# Pandas tiene la función pd.to_datetime que convierte una cadena en tipo datetime64[ns]
# Intentamos a ver si Python reconoce el formato en nuestro caso. 
# Agregamos la opción de que el primer dato es el día (dayfirst=True)
df_work2['Fecha']=pd.to_datetime(df_work2['Fecha'], dayfirst=True).copy()
print(df_work1.head())

        Fecha  Precip  Evap  Tmax  Tmin
0  01/02/1967     0.0   NaN  20.0   8.0
1  02/02/1967     0.0   NaN  21.0   9.0
2  03/02/1967     0.0   NaN  26.0   8.0
3  04/02/1967     0.0   NaN  25.0   7.0
4  05/02/1967     0.0   NaN  23.0   7.0

In [43]:
# Verificamos que cada variable (columna), sea del tipo que esperamos.
# Observamos que la variable Fecha es de tipo 'datetime64[ns]'  
df_work2.dtypes

Fecha     datetime64[ns]
Precip           float64
Evap             float64
Tmax             float64
Tmin             float64
dtype: object

In [44]:
# Buscamos ahora añadir dos columnas adicionales: df['Año'], df['Mes']
# Usaremos la función .dt.year y .dt.month para extraer el Año y Mes de la Fecha
df_work2['Año'] = df_work2['Fecha'].dt.year
df_work2['Mes'] = df_work2['Fecha'].dt.month

In [45]:
# Verificamos que se hayan creado de forma correcta
# Tendremos ahora dos columnas adicionales que podemos utilizar para filtrar información.
print(df_work2.head())
print(df_work2.tail())

       Fecha  Precip  Evap  Tmax  Tmin   Año  Mes
0 1967-02-01     0.0   NaN  20.0   8.0  1967    2
1 1967-02-02     0.0   NaN  21.0   9.0  1967    2
2 1967-02-03     0.0   NaN  26.0   8.0  1967    2
3 1967-02-04     0.0   NaN  25.0   7.0  1967    2
4 1967-02-05     0.0   NaN  23.0   7.0  1967    2
           Fecha  Precip  Evap  Tmax  Tmin   Año  Mes
17874 2016-09-26     0.0   NaN  37.0  20.0  2016    9
17875 2016-09-27     0.0   NaN  37.0  20.0  2016    9
17876 2016-09-28     0.0   NaN  38.0  20.0  2016    9
17877 2016-09-29     0.0   NaN  37.0  24.0  2016    9
17878 2016-09-30     0.0   NaN  37.0  21.0  2016    9

In [46]:
# Hasta aquí llegaremos esta semana. 
df_work2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17879 entries, 0 to 17878
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   17879 non-null  datetime64[ns]
 1   Precip  17847 non-null  float64
 2   Evap    5731 non-null   float64
 3   Tmax    17823 non-null  float64
 4   Tmin    17828 non-null  float64
 5   Año     17879 non-null  int64
 6   Mes     17879 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(2)
memory usage: 977.9 KB